<?php
    //-----------------------------------------------------------
    // 設定MySQL資料庫連線參數，採用PDO連線設定方式
    //-----------------------------------------------------------
    // 設定資料庫連線字串
    //-----------------------------------------------------------
    $dbStr = "mysql:host=localhost;dbname=act;charset=utf8";
    $dbUser = "root";
    $dbPass = "";
    //
    try
    {
        $dbLink = new PDO($dbStr, $dbUser, $dbPass);
    }
    catch (PDOExctption $pdoe)
    {
        print "資料庫連線錯誤：".$pdoe->message();
        die();
    }
    //-----------------------------------------------------------
?>